{
  "format": "layers-model",
  "generatedBy": "tensorflowjs 2.0.0",
  "convertedBy": "tensorflowjs-converter 2.0.0",
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential_model",
      "layers": [
        {
          "class_name": "Dense",
          "config": {
            "units": 64,
            "activation": "relu",
            "name": "dense_layer_1",
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1.0,
                "mode": "fan_avg",
                "distribution": "uniform",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            }
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 10,
            "activation": "softmax",
            "name": "output_layer",
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1.0,
                "mode": "fan_avg",
                "distribution": "uniform",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            }
          }
        }
      ]
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1ofX.bin"
      ],
      "weights": [
        {
          "name": "dense_layer_1/kernel",
          "shape": [null, 64],
          "dtype": "float32"
        },
        {
          "name": "dense_layer_1/bias",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "output_layer/kernel",
          "shape": [64, 10],
          "dtype": "float32"
        },
        {
          "name": "output_layer/bias",
          "shape": [10],
          "dtype": "float32"
        }
      ]
    }
  ]
}
